/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   solutions.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cchadwic <cchadwic@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/26 15:25:38 by cchadwic          #+#    #+#             */
/*   Updated: 2020/02/26 16:11:21 by cchadwic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "lemin.h"

/* <======================================> */
/* <========== Удаление решения ==========> */
/* <=============== Готово ===============> */


void	del_sol(t_solution **solution)
{
	t_solution *temp;

	while (*solution)
	{
		free((*solution)->arr);
		temp = (*solution)->next;
		free(*solution);
		*solution = temp;
	}
}